[
  {
    "path": "posts/2021-08-15-shiny-application/",
    "title": "Shiny Application",
    "description": "Shiny Application and Github link",
    "author": [
      {
        "name": "G2 Group 8",
        "url": "https://visualanalyticsproject.netlify.app/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\nShiny dashboard is available at: visual project shiny app\r\nThe source code and data are available at github.com\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T15:30:30+08:00",
    "input_file": "shiny-application.knit.md"
  },
  {
    "path": "posts/2021-08-15-application-user-guide/",
    "title": "Application User Guide",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "G2 Group 8",
        "url": "https://visualanalyticsproject.netlify.app/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\nThis shiny application contains mainly two parts, Exploratory Data Analysis(EDA) and Geospatial Mapping Visualization(GMV). Here is the overview of the panel.\r\n After you open the link of application, click the bar in the red frame to show the tabs.\r\n\r\nIt appears two tabs, which corresponds to two main functions.\r\n\r\n1. EDA\r\nUse this tab to do exploratory data analysis.\r\n\r\nClick the white triangle to find sub tabs.\r\n\r\n1.1 Ridge Plot\r\nClick Ridge Plot in the red box.\r\n\r\n\r\nAt the right side of the tab, there are two inputs for user to select.\r\n\r\nClick the black triangle to show the choices.\r\n\r\nUser can select a general category of location on the left side or choose a specific location on the right side.\r\n\r\n\r\n1.2 Bar Plot\r\nClick Bar Plot in the red box.\r\n\r\n\r\nAt the top, there are tow blanks(in red boxes) for user to input the date and number of top popular locations.\r\n\r\nClick in the Select date: blank to select date.\r\n\r\nClick in the Choose a number blank. User can use up-down triangle to adjust the number of bars to shown in the bar plot.\r\n\r\n\r\n1.3 Employee Info\r\nClick Employee Info in the red box.\r\n\r\n\r\nAt the input sidebar, there are four panel for user to filter.\r\n\r\nFor each panel, click the black triangle(highlighted in red box) to show the whole choices. User can decide to choose name, ID, Employee Type or Employee Title to do the filtering.\r\n\r\n2. GMV\r\nUse this tab to do Geospatial Mapping Visualization.\r\n\r\nClick the white triangle to find sub tabs.\r\n\r\n2.1 Line Plot\r\nClick Line Plot in the red box.\r\n\r\n\r\nThere are two features for user to select.\r\n\r\nClick the black triangle to choose the ID.\r\n\r\nUser can use mouse th drag the white dot to filter time.\r\n\r\n2.2 Dot Plot\r\nClick Dot Plot in the red box.\r\n\r\n\r\nDrag down the website to see the plot.\r\n\r\nThere are four features for user to select.\r\n\r\nClick the black triangle to choose the ID.\r\n\r\nUser can use mouse th drag the white circle to filter time.\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T18:11:08+08:00",
    "input_file": "application-user-guide.knit.md"
  },
  {
    "path": "posts/2021-08-15-research-paper/",
    "title": "Research Paper",
    "description": {},
    "author": [
      {
        "name": "G2 Group 8",
        "url": "https://visualanalyticsproject.netlify.app/"
      }
    ],
    "date": "2021-08-15",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T20:41:08+08:00",
    "input_file": "research-paper.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics Project",
    "description": "Welcome to our new blog, Visual Analytics Project. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T11:14:07+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-19-project-proposal/",
    "title": "Project Proposal",
    "description": "Abstract \n\nThis project will mainly focus on VAST Mini Challenge 2. Our team will focus on solving the problems VAST raised and give the intuitive visualization how we solve the problems. Moreover, we will provide some suggestions on how to prevent the situations in the future. The project will use R packages from tmap, igraph and tidygraph.",
    "author": [
      {
        "name": "Peirong LIN Yining BAI Manye LIU",
        "url": "https://visualanalyticsproject.netlify.app/"
      }
    ],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\r\n1. Motivation of Project\r\nWe ultimately aim to shed some light onto the people and the locations that the law enforcement should investigate by analyzing the movement and tracking data provided, thereby contributing to the investigation towards finding the missing staff members.\r\n2. Objectives\r\nWe will use the data including two parts. One is tracking data for the two weeks leading up to the disappearance, and the other is credit card transactions and loyalty card usage data. We will use geographical data as a complement. \r\n3. Problem and issue\r\nThe number of kidnap case is quite large in this region. To better find the suspect and reduce the case happening, we need to find the suspects regarding to the data we have.\r\n4. The relevant related work\r\nHere is some related works we found. Related work from 2014 Social relationship finding: network, igraph, tidygraph\r\n5. The approach to solve the problems\r\nTasks and Questions:\r\nUsing just the credit and loyalty card data, identify the most popular locations, and when they are popular. What anomalies do you see? What corrections would you recommend to correct these anomalies?\r\n\r\nAns: We can use the map to build the geographical chart to visualize the most popular location, and indicate the most popular time to visit. Anomalies can be the difference popular location between suspect and normal people. (Since we only have two weeks of data, we can only know the recent popular area a person would often go, if the place is far away from the majority, he/she might be the suspect.)\r\nAdd the vehicle data to your analysis of the credit and loyalty card data. How does your assessment of the anomalies in question 1 change based on this new data\r\n\r\nAns: We can draw line plot based on the location (latitude and longitude) for every minute move. Then, we can compare the result with question 1.\r\nCan you infer the owners of each credit card and loyalty card? What is your evidence? Where are there uncertainties in your method? Where are there uncertainties in the data?\r\n\r\nAns: By using Timestamp, location and price, we can find the relationship between credit card and loyalty card. We can know for a loyalty card, which credit card is often used after using this loyalty card. There might be some uncertainties because we don’t have the information of name.\r\nGiven the data sources provided, identify potential informal or unofficial relationships among GASTech personnel. Provide evidence for these relationships.\r\n\r\nAns: First, we need to transform latitude and longitude to location. Then, combining with the data with timestamp, we can track the name and merge it with loyalty card and credit card information.\r\nGiven the data sources provided, identify potential informal or unofficial relationships among GASTech personnel. Provide evidence for these relationships.\r\n\r\nAns: We will first solve the problems individually and after finishing all the steps, we will discuss and combine the works together.\r\n6. Storyboard\r\nWe will use Rshiny to show the storyboard finally. After finishing our assignments individually, we will combine our storyboard into 1.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-15T15:54:14+08:00",
    "input_file": "project-proposal.knit.md"
  }
]
